## ASSIGNMENT 3
NAME:A.KULADEEP<br>
REG.NO:21-27-01<br>
DATASCIENCE<br>

In [198]:
import pandas as pd
import numpy as np

## Read CSV file and display frist 6 rows of dataframe

In [199]:
df=pd.read_csv("housingdata.csv")
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

## Coloumn names and row index

In [200]:
columns=list(df.columns)
rows=list(df.index)
print(columns)
print(rows)

['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']
[0, 1, 2, 3, 4, 5, 6, 7, 8]

## Number of States and Unique no of states

In [201]:
df['STATE'].unique()

array(['MP', 'MAHARASHTRA', 'AP', 'TN', 'ASSAM', 'HP'], dtype=object)

In [202]:
df['STATE'].shape

(9,)

In [203]:
df['STATE'].value_counts()

TN             3
HP             2
MAHARASHTRA    1
AP             1
ASSAM          1
MP             1
Name: STATE, dtype: int64

## Retrieve all NANs in the form of boolean list

In [204]:
x=np.array(df)

In [205]:

nans=[]
row,column=x.shape[0],x.shape[1]
print(row,column)
for i in range(row):
    List=[]
    for j in range(column):
        try:
            float(x[i][j])
            if float(x[i][j])>0 or float(x[i][j])<=0:
                List.append(True)
            else:
                List.append(False)
        except ValueError:
            if isinstance(x[i][j],str):
                if x[i][j].isalpha():
                    if x[i][j]=='HURLEY' or x[i][j]=='na':
                        List.append(False)
                    else:
                        List.append(True)
                else:
                    List.append(False)
     
    nans.append(List)
nans

9 6

[[True, True, True, True, True, True],
 [True, True, True, True, True, False],
 [True, True, True, False, True, True],
 [True, True, True, True, False, True],
 [False, True, True, True, True, True],
 [True, True, True, False, True, True],
 [True, True, True, True, False, True],
 [True, True, True, True, True, False],
 [True, True, True, False, True, True]]

## Delete all rows with NaN values

In [206]:
df1=df.copy()
index1=[]
for i in range(len(df)):
    try:
        int(df1['NUM_BEDROOMS'][i])
    except ValueError:
        index1.append(i)
        continue
df1.drop(df1.index[index1], inplace=True)
df1

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

## Replace NaN with previous entry

In [209]:
df_new=df.copy()
for i in range(len(df)):
    try:
        a=float(df_new['NUM_BATH'][i])
        if a>0 or a<=0:
            continue
        else:
            df_new['NUM_BATH'][i]=df_new['NUM_BATH'][i-1]
    except ValueError:
        df_new['NUM_BATH'][i]=df_new['NUM_BATH'][i-1]
df_new

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1        1   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2        1   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

## Replace empty values in SQ_FT with mean

In [211]:
index1=[]
sum=0
count=0
for i in range(len(df)):
    try:
        a=int(df_new['SQ_FT'][i])
        sum+=a
        count+=1
    except ValueError:
        index1.append(i)
mean=sum/count
for i in index1:
    df_new["SQ_FT"][i]=mean  
df_new

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1    1000
1  100002000.0  MAHARASHTRA      21325            3      1.5  1100.0
2  100003000.0           AP    2541654          NaN        1     850
3  100004000.0           TN     321321            1        1     700
4          NaN           TN  589465645            3        2    1600
5  100006000.0           TN   65465466          NaN        1     800
6  100007000.0        ASSAM    3222321            2        1     950
7  100008000.0           HP      23131            1        1  1100.0
8  100009000.0           HP      21212           na        2    1800

## Sum of all values in column SQ_FT

In [212]:
sum=0
for i in range(len(df)):
    sum+=int(df_new['SQ_FT'][i])
sum

9900

## Add new coloumn NUM_STORE

In [213]:
df_new['NUM_STORE']=np.array([1 for i in range(len(df))]).reshape(9,1)
df_new

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1,1000,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1100.0,1
2,100003000.0,AP,2541654,NaN,1,850,1
3,100004000.0,TN,321321,1,1,700,1
4,NaN,TN,589465645,3,2,1600,1
5,100006000.0,TN,65465466,NaN,1,800,1
6,100007000.0,ASSAM,3222321,2,1,950,1
7,100008000.0,HP,23131,1,1,1100.0,1
8,100009000.0,HP,21212,na,2,1800,1

## New DataFrame with entries of TN only

In [214]:
df2=df_new.loc[df.STATE=='TN']
df2

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1        1   700          1
4          NaN    TN  589465645            3        2  1600          1
5  100006000.0    TN   65465466          NaN        1   800          1

## SQ_FT >1000

In [215]:
df3=df_new.copy()
index1=[]
for i in range(len(df)):
    if int(df_new["SQ_FT"][i])<1000:
        index1.append(i)
df3.drop(index1,axis=0,inplace=True)
df3

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1,1000,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1100.0,1
4,NaN,TN,589465645,3,2,1600,1
7,100008000.0,HP,23131,1,1,1100.0,1
8,100009000.0,HP,21212,na,2,1800,1

## Slicing a DF

In [221]:
df4=df_new.iloc[0:3,0:3]
df4

           PID        STATE    PRICE
0  100001000.0           MP   321654
1  100002000.0  MAHARASHTRA    21325
2  100003000.0           AP  2541654

## State having highest average price per square foot

In [231]:
averageprice=[]
for i in range(len(df)):
    a=float(df_new['PRICE'][i])/float(df_new['SQ_FT'][i])
    averageprice.append((i,a))

avg=sorted(averageprice,key=lambda x:x[1],reverse=True)
index=avg[0][0]
print(df["STATE"][index])

TN